package pag1;

/**
 * Операции,предшествования(приоритет порядка исполнения)
 *
 */
public class Os_pred {

    public static void main(String args[]) {
        System.out.println("Наивысший предшествование \n++--постфиксная операция\n"
                + "++--префиксная операция; +-унарная операция;приведение типов\n"
                + "*; /; %;\n"
                + "+; -;\n"
                + ">>; >>>; <<;\n"
                + ">; >=; <; <=\n"
                + "==; !=\n"
                + "&;\n"
                + "^;\n"
                + "|;\n"
                + "&&;\n"
                + "||;\n"
                + "?:\n"
                + "->;\n"
                + "=;\n"
                + "Наинисшие предшествование" 
       );

    }
}
