package pag1;

/**
 * Операции,поразрядные операции манипулируют двоичными разрядами (битами) в
 * целочисленном значении<br>Все целочисленные типы данных представлены
 * двоичными числами разной длины<br>42 это 00101010=степень числа два с 2° в
 * крайнем справа разряде 42=2(1)+2(3)+2(5)=2+8+32<br>Отрицательные числа в Java
 * представлены в дополнительном коде путем инвертирования (изменения 1 на О и
 * наоборот) всех двоичных разрядов исходного значения и последующего добавления
 * 1 к результату<br> -42 это 11010101 добавляется 1 итог 1101010110<br>Чтобы
 * получить положительное число из отрицательного, нужно сначала инвертировать
 * все его двоичные разряды, а затем добавить 1 к результату<br>НЕ(~)-
 * поразрядиым отрицанием инвертируя все двоичные разряды своего операнда<br>И
 * (&)- устанавливается 1 когда двоичные разряды в операндах также равны
 * 1<br>ИЛИ(|)-устанавливается1,если двоичный разряд в любом из операндов
 * равен1<br>ИЛИ(^)-устанавливается1,если двоичный разряд только в одном из
 * операндов равен 1<br>
 *
 */
public class Os_p {

    public static void main(String args[]) {

    }
}
