package pag_doc;

/**
 * Операция инкремента увеличивает значение операнда(аргумента) на единицу,а
 * операция декремента уменьшает значение операнда(аргумента) на единицу<br>
 * постфиксный следует за операндом(аргументом) (a++)<br>
 * префиксной операция предшествует операнду(++a)
 * Операции;арифметические,поразрядные,логические,отношения<br>Арифметические
 * операции применяются в математеских выражениях таким же образом, как и в
 * алгебре<br>Деление по модулю % возвращает остаток от деления<br>Операции,
 * поразрядные,сдвиг разрядов влево,прав- смещает все двоичные разряды значения
 * влево или в право на указанное количество позиций<br>значение [2стрелки влево
 * или в право] количествовo<br>беззнаковый сдвиг, три стрелки в право(вставляет
 * нуль на позиции сдвигаемого разряда)<br>поддерживаются составные
 * поразрядные<br>Операции,деления по модулю оставляет остаток от
 * деления<br>Операции,отношения(логические),определяют отношение одного
 * операнда к другому<br>Операции,поразрядные операции манипулируют двоичными
 * разрядами (битами) в целочисленном значении<br>Все целочисленные типы данных
 * представлены двоичными числами разной длины<br>42 это 00101010=степень числа
 * два с 2° в крайнем справа разряде
 * 42=2x1+2x2x2+2x2x2X2x2=2+8+32<br>Отрицательные числа в Java представлены в
 * дополнительном коде путем инвертирования (изменения 1 на О и наоборот) всех
 * двоичных разрядов исходного значения и последующего добавления 1 к
 * результату<br>-42 это 11010101 добавляется 1 итог 1101010110<br>Чтобы
 * получить положительное число из отрицательного, нужно сначала инвертировать
 * все его двоичные разряды, а затем добавить 1 к результату<br>НЕ(~)-
 * поразрядиым отрицанием инвертируя все двоичные разряды своего
 * операнда<br>И-устанавливается 1 когда двоичные разряды в операндах также
 * равны 1<br>ИЛИ(|)-устанавливается1,если двоичный разряд в любом из операндов
 * равен1<br>ИЛИ(^)-устанавливается1,если двоичный разряд только в одном из
 * операндов равен 1<br>Операции отношения-оперциями сравненuя
 * определяют отношение одного операнда к другому<br>Логические операции-соединяют два
два логических значения, образуя результирующее логическое значение
 *
 *
 */
public class doc {

}
